app/views/projects/show.html.erb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]
---

<% if @project.tasks.count>0%>