app/controllers/projects_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]
---
  def simulate(project,epochs,dist)

    @dur_simulation = []
    @dur_sim_freq = {}
    @dur_sim_freq_cumul = {}
    @cost_simulation = []
    @cost_sim_freq = {}
    @cost_sim_freq_cumul = {}
    dur_simulations_params=[]
    cost_simulations_params=[]
    for i in 1..epochs
      current_dur_simulation_params={}
      current_dur_simulation_params['tasks']=[]
      current_cost_simulation_params={}
      current_cost_simulation_params['tasks']=[]
      current_dur_simulation = 0
      min_dur=0
      max_dur=0
      current_cost_simulation = 0
      min_cost=0
      max_cost=0
      take_number=0
      project.tasks.each do |task|